In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

# Object Creation

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01 -1.749866  0.094734  0.425853  1.072841
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683
2013-01-05  0.644458  0.533958  0.053234  0.207451
2013-01-06 -1.795272 -0.029150  1.387284 -1.129794

In [27]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(2)),dtype='float32'),
   ....:                      'D' : np.array([2] * 2,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train"]),
   ....:                      'F' : 'foo' })

In [28]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  2   test  foo
1  1.0 2013-01-02  1.0  2  train  foo

In [29]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [30]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-30-915637deb483>, line 1)

# Viewing Data

In [31]:
df.head()

                   A         B         C         D
2013-01-01 -1.749866  0.094734  0.425853  1.072841
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683
2013-01-05  0.644458  0.533958  0.053234  0.207451

In [32]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683
2013-01-05  0.644458  0.533958  0.053234  0.207451
2013-01-06 -1.795272 -0.029150  1.387284 -1.129794

In [33]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [34]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
df.values

array([[-1.74986575,  0.09473351,  0.42585337,  1.0728408 ],
       [ 0.2084644 , -1.47723894, -0.35151788, -0.51961953],
       [-0.26955698, -0.69123427, -0.00403302,  0.06755156],
       [-0.99922274, -0.98636829,  0.6736494 , -0.03568308],
       [ 0.64445836,  0.5339584 ,  0.05323434,  0.2074509 ],
       [-1.7952724 , -0.02915026,  1.38728408, -1.12979378]])

In [36]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.660166 -0.425883  0.364078 -0.056209
std    1.019805  0.753610  0.614949  0.738558
min   -1.795272 -1.477239 -0.351518 -1.129794
25%   -1.562205 -0.912585  0.010284 -0.398635
50%   -0.634390 -0.360192  0.239544  0.015934
75%    0.088959  0.063763  0.611700  0.172476
max    0.644458  0.533958  1.387284  1.072841

In [37]:
df.T # Transposing your data:

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.749866    0.208464   -0.269557   -0.999223    0.644458   -1.795272
B    0.094734   -1.477239   -0.691234   -0.986368    0.533958   -0.029150
C    0.425853   -0.351518   -0.004033    0.673649    0.053234    1.387284
D    1.072841   -0.519620    0.067552   -0.035683    0.207451   -1.129794

In [39]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01 -1.749866  0.094734  0.425853  1.072841
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683
2013-01-05  0.644458  0.533958  0.053234  0.207451
2013-01-06 -1.795272 -0.029150  1.387284 -1.129794

In [43]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.072841  0.425853  0.094734 -1.749866
2013-01-02 -0.519620 -0.351518 -1.477239  0.208464
2013-01-03  0.067552 -0.004033 -0.691234 -0.269557
2013-01-04 -0.035683  0.673649 -0.986368 -0.999223
2013-01-05  0.207451  0.053234  0.533958  0.644458
2013-01-06 -1.129794  1.387284 -0.029150 -1.795272

In [45]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-05  0.644458  0.533958  0.053234  0.207451
2013-01-01 -1.749866  0.094734  0.425853  1.072841
2013-01-06 -1.795272 -0.029150  1.387284 -1.129794
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620

# Selection

## Getting

In [46]:
df['A']

2013-01-01   -1.749866
2013-01-02    0.208464
2013-01-03   -0.269557
2013-01-04   -0.999223
2013-01-05    0.644458
2013-01-06   -1.795272
Freq: D, Name: A, dtype: float64

In [48]:
df[0:2]

                   A         B         C         D
2013-01-01 -1.749866  0.094734  0.425853  1.072841
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620

In [49]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683

## Selection by Label

In [53]:
df.loc[dates[0]]# For getting a cross section using a label:

A   -1.749866
B    0.094734
C    0.425853
D    1.072841
Name: 2013-01-01 00:00:00, dtype: float64

In [51]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [54]:
df.loc[:,['A','B']] #Selecting on a multi-axis by label:

                   A         B
2013-01-01 -1.749866  0.094734
2013-01-02  0.208464 -1.477239
2013-01-03 -0.269557 -0.691234
2013-01-04 -0.999223 -0.986368
2013-01-05  0.644458  0.533958
2013-01-06 -1.795272 -0.029150

In [56]:
df.loc['20130102':'20130104',['A','B']]# Showing label slicing, both endpoints are included:

                   A         B
2013-01-02  0.208464 -1.477239
2013-01-03 -0.269557 -0.691234
2013-01-04 -0.999223 -0.986368

In [59]:
df.loc['20130102',['A','B']]# Reduction in the dimensions of the returned object:

A    0.208464
B   -1.477239
Name: 2013-01-02 00:00:00, dtype: float64

In [60]:
df.loc[dates[0],'A'] #For getting a scalar value:

-1.7498657477241064

In [61]:
df.at[dates[0],'A']# For getting fast access to a scalar (equivalent to the prior method):

-1.7498657477241064

## Selection by Position

In [62]:
df.iloc[3]# Select via the position of the passed integers:

A   -0.999223
B   -0.986368
C    0.673649
D   -0.035683
Name: 2013-01-04 00:00:00, dtype: float64

In [63]:
df.iloc[3:5,0:2]# By integer slices, acting similar to numpy/python

                   A         B
2013-01-04 -0.999223 -0.986368
2013-01-05  0.644458  0.533958

In [64]:
df.iloc[[1,2,4],[0,2]]# By lists of integer position locations, similar to the numpy/python style:

                   A         C
2013-01-02  0.208464 -0.351518
2013-01-03 -0.269557 -0.004033
2013-01-05  0.644458  0.053234

In [65]:
df.iloc[1:3,:]# For slicing rows explicitly:

                   A         B         C         D
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552

In [66]:
df.iloc[:,1:3]# For slicing columns explicitly:

                   B         C
2013-01-01  0.094734  0.425853
2013-01-02 -1.477239 -0.351518
2013-01-03 -0.691234 -0.004033
2013-01-04 -0.986368  0.673649
2013-01-05  0.533958  0.053234
2013-01-06 -0.029150  1.387284

In [67]:
df.iloc[1,1]# For getting a value explicitly:

-1.4772389379323045

In [68]:
df.iat[1,1]# For getting fast access to a scalar (equivalent to the prior method):

-1.4772389379323045

## Boolean Indexing

In [69]:
df[df.A > 0]# Using a single columns values to select data.

                   A         B         C         D
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620
2013-01-05  0.644458  0.533958  0.053234  0.207451

In [70]:
df[df > 0]# Selecting values from a DataFrame where a boolean condition is met.

                   A         B         C         D
2013-01-01       NaN  0.094734  0.425853  1.072841
2013-01-02  0.208464       NaN       NaN       NaN
2013-01-03       NaN       NaN       NaN  0.067552
2013-01-04       NaN       NaN  0.673649       NaN
2013-01-05  0.644458  0.533958  0.053234  0.207451
2013-01-06       NaN       NaN  1.387284       NaN

In [71]:
df2 = df.copy()

In [72]:
df2['E'] = ['one', 'one','two','three','four','three']# use comma

In [73]:
df2# Using the isin() method for filtering:

                   A         B         C         D      E
2013-01-01 -1.749866  0.094734  0.425853  1.072841    one
2013-01-02  0.208464 -1.477239 -0.351518 -0.519620    one
2013-01-03 -0.269557 -0.691234 -0.004033  0.067552    two
2013-01-04 -0.999223 -0.986368  0.673649 -0.035683  three
2013-01-05  0.644458  0.533958  0.053234  0.207451   four
2013-01-06 -1.795272 -0.029150  1.387284 -1.129794  three

## Setting

In [74]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [75]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [ ]:
df.at[dates[0],'A'] = 0# Setting values by label: